tests/data/roc_it_hierarchy_decom_2.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>opsmuser</wsse:Username>
                <wsse:Password>opsm1234</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body>
        <ns2:retrievePackagingHierarchy xmlns:ns2="http://xmlns.oracle.com/oracle/apps/pas/serials/serialsService/applicationModule/common/types/" xmlns:ns3="http://xmlns.oracle.com/adf/svc/errors/" xmlns:ns4="http://xmlns.oracle.com/oracle/apps/pas/serials/serialsService/view/common/" xmlns:ns5="commonj.sdo" xmlns:ns6="http://xmlns.oracle.com/oracleas/schema/oracle-fault-11_0">
            <ns2:voRow>
                <ns4:TagId>urn:epc:id:sgtin:0397799.207062.2190390007049</ns4:TagId>
                <ns4:SendChildren>true</ns4:SendChildren>
                <ns4:SendProductInformation>true</ns4:SendProductInformation>
            </ns2:voRow>
        </ns2:retrievePackagingHierarchy>
    </soap:Body>
</soap:Envelope>
